<template>
  <div class="about-icpc">
    <img src="../../../../../assets/acm-icpc.png" style="margin: 5px; float: right; width: 225px; height: 150px;"/>
    <section>
      <h1>ACM国际大学生程序设计竞赛</h1>
      <p>
        　　ACM国际大学生程序设计竞赛（简称ACM-ICPC）是由国际计算机界具有悠久历史的权威性组织ACM学会（AssociationforComputingMachinery）主办，是世界上公认的规模最大、水平最高、参与人数最多的大学生程序设计竞赛，其宗旨是使大学生能通过计算机充分展示自己分析问题和解决问题的能力。
      </p><p>　　ACM-ICPC赛事是目前国内高校承办的唯一一项具有国际影响的计算机竞赛。中国大陆地区的高校从1996年开始承办ACM-ICPC亚洲区预选赛。前六届在中国大陆地区仅设上海赛区，由上海大学承办；2002年分设北京和西安赛区，分别由清华大学和西安交通大学承办；2003年设北京和广州赛区，分别由清华大学和中山大学承办;2004年设北京和上海赛区,分别由北京大学和上海交通大学举办;2005年分设北京、杭州、成都赛区,分别由北京大学、浙江大学和四川大学承办;2006年分设上海、北京、西安三个赛区,分别由于上海大学、清华大学和西安电子科技大学承办。2007年第32届ACM-ICPC亚洲赛区预选赛在中国大陆地区分设南京、长春、北京、成都四个赛区,分别由南京航空航天大学、吉林大学、北京航空航天大学和西华大学承办。中国大陆地区的现场赛参赛队数达到了380队,参赛学校包括北京大学、清华大学、复旦大学、上海交通大学、浙江大学、中山大学、中国科技大学、台湾大学等著名高校以及朝鲜等国家和地区的高等学校,最终亚洲有35队晋级总决赛,中国地区（包括香港和台湾）共有18队晋级总决赛。2008年第33届ACM-ICPC亚洲区预选赛在中国大陆地区设立了五个赛区,分别是哈尔滨赛区(由哈尔滨工程大学承办)、北京赛区(由北京交通大学承办)、合肥赛区(由中国科学技术大学承办)、杭州赛区(由杭州电子科技大学承办)、成都赛区(由西南民族大学承办),共有超过5000支参赛队参加了五个赛区的网络赛及相关赛事,超过500支参赛队参加五个赛区的现场赛,亚洲共有35队晋级参加了在瑞典斯德哥尔摩举行的全球总决赛,中国地区(包括香港和台湾)共有19队晋级总决赛,最终清华大学代表队获得了金奖和总决赛亚军、浙江大学代表队获得银奖、华南理工大学代表队获得铜奖。
    </p><p>　　2009年第34届ACM-ICPC亚洲区预选赛在中国大陆地区有五个赛区,分别是哈尔滨赛区(由哈尔滨工业大学承办)、合肥赛区(由中国科学技术大学承办)、宁波赛区(由浙江大学宁波理工学院承办)、上海赛区(由东华大学承办)和武汉赛区(由武汉大学承办)。
    </p><p>　　亚洲地区的高校可组队参加在亚洲的所有赛区的预选赛,但每位参赛选手在一个年度内至多只能参加两个赛区的预选赛。2009年度亚洲区共设立了十五个赛区,每个赛区的第一名将自动晋级全球总决赛。
    </p><p>　　2009年亚洲区共有37队获得参加2010年在哈尔滨举行的ACM-ICPC全球总决赛资格。
    </p><p>    由IBM赞助哈尔滨工程大学承办的第34届ACM国际大学生程序设计竞赛全球总决赛于2010年2月1日至5日在哈尔滨举行。上海交通大学第三次获得全球总决赛冠军,莫斯科大学、台湾大学、基辅塔拉斯舍甫琴柯大学分获亚军、季军和第四名,前四名的参赛队均获得了金牌和IBM的工作和实习机会。
    </p><p>　　各大洲的冠军为:北美冠军-斯坦福大学,欧洲冠军-莫斯科大学,非洲和中东冠军-埃及英国大学,拉美冠军-伯南布哥大学,亚洲冠军-上海交通大学,南太平洋冠军-西澳大利亚大学。
    </p><p>　　2009年度全球共有共7109队参加了该项赛事,这些参赛队分别来自六大洲82个国家或地区的1931所高校,最终共有103队入围全球总决赛。
    </p><p>　　自1997年开始,IBM已经连续十三年为ACM-ICPC提供全球范围的赞助。竞赛平台采用了UbuntuLinux或OpenSolaris操作系统，开发工具包括：SunStudio、Netbeans、Eclipse、codeblocks等。
    </p><p>　　   </p><p><b>竞赛规则:</b>
    </p><p>　　1.参赛队组成
    </p><p>　　ACM-ICPC以团队的形式代表各学校参赛，参赛队可以来自亚洲任何的国家和地区的高校,每个赛区的优胜队伍将获得参加ACM国际大学生程序设计竞赛全球总决赛资格。
    </p><p>　　亚洲区的高校可以组队参加亚洲的任何一个或者几个赛区的比赛，但每所高校最多只能有一队可以获得参加全球世界决赛的资格。每队由一名教练和三名队员组成,有些赛区还允许有一名候补队员。教练是参赛队伍所代表高校的正式教师，教练必须保证所有队员符合本规则的规定。教练作为参赛队伍的代表，负责赛区预赛活动中的联系工作。每位队员必须是在校学生，有一定的年龄限制，亚洲区的每位参赛选手在一年内最多可参加两个赛区的亚洲区预选赛,每位选手最多可以参加五届亚洲区预选赛和两届全球总决赛。
    </p><p>　　2.竞赛过程
    </p><p>　　(1).竞赛中至少命题8题，比赛时间为5个小时。
    </p><p>　　(2).参赛队员可以携带诸如书、手册、程序清单等参考资料。
    </p><p>　　(3).试题的解答提交裁判称为运行，每一次运行会被判为正确或者错误，判决结果会及时通知参赛队伍。
    </p><p>　　(4).正确解答中等数量及中等数量以上试题的队会根据解题数目进行排名。在决定获奖和参加世界决赛的队伍时，如果多支队解题数量相同，则根据总用时加上惩罚时间进行排名。总用时和惩罚时间由每道解答正确的赛题的用时加上罚时而成。每道题用时将从竞赛开始到该题解答被判定为正确为止，其间每一次错误的运行将被加罚20分钟时间，未正确解答的试题不记时。
    </p><p>　　(5).亚洲区预选赛语言包括C++、C和Java。
    </p><p>　　(6).每支队伍使用一台计算机，所有队伍使用计算机的规格配置完全相同。
    </p>
    </section>
  </div>
</template>

<script>
  export default {

  }
</script>

<style lang="scss" scoped>
  .about-icpc {
    margin: 20px 2%;
    p {
      margin: 0;
      text-indent: 2em;
    }
  }
</style>
